In [18]:
import pandas as pd

from gradient_descent.spam import model

In [19]:
df = pd.read_csv('titanic.csv')

df.head()

,passenger_id,name,p_class,sex,age,sib_sp,parch,ticket,fare,cabin,embarked,survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,NaN,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [20]:
df.shape

(891, 12)

In [21]:
df.columns

Index(['passenger_id', 'name', 'p_class', 'sex', 'age', 'sib_sp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'survived'],
      dtype='object')

In [22]:
# value count of the survived column

df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [23]:
df.isnull().sum()

passenger_id      0
name              0
p_class           0
sex               0
age             177
sib_sp            0
parch             0
ticket            0
fare              9
cabin           687
embarked          2
survived          0
dtype: int64

In [26]:
df.fillna({'age': df['age'].median()}, inplace=True)
df.fillna({'fare': df['fare'].median()}, inplace=True)

df.head()

,passenger_id,name,p_class,sex,age,sib_sp,parch,ticket,fare,cabin,embarked,survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,14.4542,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [27]:
df.isna().sum()

passenger_id      0
name              0
p_class           0
sex               0
age               0
sib_sp            0
parch             0
ticket            0
fare              0
cabin           687
embarked          2
survived          0
dtype: int64

In [28]:
df.drop('name', axis=1, inplace=True)

In [29]:
df['sex'] = df['sex'].map({'male': 1, 'female': 2})

df.head()

,passenger_id,p_class,sex,age,sib_sp,parch,ticket,fare,cabin,embarked,survived
0,1,3,1,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,2,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,2,26.0,0,0,STON/O2. 3101282,14.4542,NaN,S,1
3,4,1,2,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,1,35.0,0,0,373450,8.0500,NaN,S,0

In [32]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, confusion_matrix

X = df[['p_class', 'sex', 'age', 'sib_sp', 'parch' ,'fare']]
y = df['survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [33]:
from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.79      0.80      0.79       157
           1       0.71      0.69      0.70       111

    accuracy                           0.76       268
   macro avg       0.75      0.75      0.75       268
weighted avg       0.76      0.76      0.76       268

In [34]:
from sklearn.ensemble import RandomForestClassifier

model = RandomForestClassifier()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.79      0.85      0.82       157
           1       0.77      0.68      0.72       111

    accuracy                           0.78       268
   macro avg       0.78      0.77      0.77       268
weighted avg       0.78      0.78      0.78       268

In [35]:
from sklearn.ensemble import GradientBoostingClassifier

model = GradientBoostingClassifier()
model.fit(X_train, y_train)

y_pred = model.predict(X_test)
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.81      0.91      0.86       157
           1       0.85      0.69      0.76       111

    accuracy                           0.82       268
   macro avg       0.83      0.80      0.81       268
weighted avg       0.82      0.82      0.82       268